Revit 2024 API
ColorWithTransparency Members
The ColorWithTransparency type exposes the following members.
Constructors
Name | Description
ColorWithTransparency()
 color
ColorWithTransparency(UInt32, UInt32, UInt32, UInt32)
 color
Methods
Name | Description
Dispose
Releases all resources used by the ColorWithTransparency
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBlue
 get blue
GetColor
 get color
GetGreen
 get green
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRed
 get red
GetTransparency
 get transparency
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetBlue
 set blue
SetColor
 set color
SetGreen
 set green
SetRed
 set red
SetTransparency
 set transparency
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace